"""
python中有六个数据类型
1. number类型
2. string类型 字符串
3. list类型 列表 []
4. tuple类型 元组 ()
5. dict类型 字典 {key:value.....}
6. set类型 集合  {}

"""

"""
1. number类型 主要包括int，float和bool类型（True/False）首字母大写

注意：在python中，bool类型被归纳为int类型的一个子类

2. string类型
主要由数字，字母，下划线和汉字等组成的一串字符，使用单引号或者双引号包裹或者三引号

"""
print("世龙说‘今天天气很好’")  # 世龙说‘今天天气很好’
# 之所以双引号都能表示字符串，是为了在这种需要多次使用引号的情况下进行交叉使用

# 三引号是可以保留格式的字符串
print('''
静夜思⑴
床前明月光⑵，疑是地上霜⑶。
举头望明月⑷，低头思故乡。

''')


"""
3. list类型

列表用【】表示，里面可以存放字符，数字，字符串，还能嵌套列表，
列表是有顺序的，可以通过下标访问

4. tuple类型
元组类型用（）表示，一种特殊的列表，区别在于元组中的内容不能被更改

5. dict类型
字典类型通过{key:value}表示

6. set类型
集合类型通过{}，里面没有重复的值，且是没有顺序的

"""











